from ..settings import *
# ======================================================================================================================
# تنظیمات امنیتی و توسعه
# ======================================================================================================================
SECRET_KEY = 'django-insecure-s5(mw%45u6kw5v5amxq*uqd54q4jsmih2nhiv_r&o8q&-5@hu4'  # کلید امنیتی پروژه
DEBUG = True  # حالت توسعه (برای محیط تولید باید False شود)
ALLOWED_HOSTS = []  # دامنه‌های مجاز برای پروژه
# ======================================================================================================================
# پایگاه داده
# اینجا از SQLite برای توسعه استفاده شده است
# برای محیط تولید معمولاً PostgreSQL یا MySQL استفاده می‌شود
# ======================================================================================================================
DATABASES = {
    "default": {
        "ENGINE": "django.db.backends.sqlite3",  # موتور پایگاه داده
        "NAME": BASE_DIR / "db.sqlite3",        # مسیر فایل دیتابیس
    }
}
# ======================================================================================================================